# Найдите сумму наибольшего и наименьшего элементов массива.

def sumofmaxandmin(list):
    return max(list)+min(list)
print(sumofmaxandmin([1,2,3,4,5,6,7]))

