# Создать массив, на четных местах в котором стоят единицы,
#  а на нечетных местах - числа, 
# равные остатку от деления своего номера на 5.

# task 1
# a=[]
# for i in range(1, int(input('Длина списка ?')) + 1): это способ еще легче чем тот запрос!где мы пишем больше кода чем надо!
#     if i % 2 == 0:
#        a.append(5)
#     else:
#         a.append(1)
# print(a)

# task 2
# def even_odd():
#     a=[]
#     for i in range(1, int(input('Длина списка ?')) + 1):
#         if i % 2 == 0:
#             a.append(5)
#         else:
#             a.append(1) 
#     print(a)   
# even_odd()
        
   


