# Дан массив. Найдите два соседних элемента, сумма которых минимальна.



# def SumOfelems(list):
#     summ=list[0]+list[1]
#     return summ
# print(SumOfelems[1,2,3,4,5,6])